app/views/end_users/orders/new.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ?  [["end_user_id", 3]]
---
		        <div>
			        <%= collection_select(:address, :address_id, current_end_user.addresses.all, :id, :full_address, include_blank: "選択して下さい") %>