app/views/end_users/orders/verification.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 3]]
---
		<tbody>
			<% current_end_user.cart_items.each do |cart_item| %>