app/controllers/admins/items_controller.rb

    def create
		@item = Item.new(item_params)
        if @item.save
---
INSERT INTO "items" ("created_at", "updated_at", "name", "description", "genre_id", "price", "status", "image_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@item = Item.find(params[:id])
		if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "items" SET "description" = ?, "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "大切なあの人のお祝いに華を添えましょう"], ["image_id", "67b2875bebb1dc7c5af6a0767d97a46964ebf49b73465067da9fd71234b0"], ["updated_at", "2020-04-17 04:40:03.580109"], ["id", 12]]

	def destroy
		items = Item.find(params[:id])
		if items.destroy
			redirect_to admins_items_path(@item)
	    else
	    	@items = Item.all
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
SELECT "items".* FROM "items"