app/controllers/admins/order_details_controller.rb

    def update
        order_detail = OrderDetail.find(params[:id])
        order_detail.update(order_detail_params)

        @order = order_detail.order

		if order_detail.make_status_before_type_cast == 2
		  order_detail.order.update(order_status: 2)
		end

		count = 0
		@order.order_details.each do |order_detail|
		  if order_detail.make_status_before_type_cast == 3
		    count += 1
		  end
		end
		if count == @order.order_details.count
		  @order.update(order_status: 3)
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 2], ["updated_at", "2020-05-03 09:35:36.273336"], ["id", 8]]
UPDATE "order_details" SET "make_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["make_status", 2], ["updated_at", "2020-05-03 09:35:36.249005"], ["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 8]]
SELECT COUNT(*) FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 8]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 3], ["updated_at", "2020-05-03 09:35:39.724522"], ["id", 8]]