app/controllers/admins/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        @order = Order.find(params[:id])
        @order_details = @order.order_details

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 1], ["updated_at", "2020-05-03 09:01:06.958698"], ["id", 8]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 8]]
UPDATE "order_details" SET "make_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["make_status", 1], ["updated_at", "2020-05-03 09:01:06.984314"], ["id", 1]]
---
    def update
        @order = Order.find(params[:id])
        @order.update(order_params)

        if @order.order_status_before_type_cast == 1
            @order.order_details.each do |order_detail|
                order_detail.update(make_status: 1)