app/controllers/end_users/addresses_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ?  [["end_user_id", 7]]
---
    def index
        @address = Address.new
        @addresses = Address.where(end_user_id: current_end_user.id)

INSERT INTO "addresses" ("created_at", "updated_at", "end_user_id", "postalcode", "street_address", "address") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2020-05-01 12:55:42.656823"], ["updated_at", "2020-05-01 12:55:42.656823"], ["end_user_id", 7], ["postalcode", "234-234"], ["street_address", "geodoo"], ["address", "kfpworj"]]
---
    def create
        address = Address.new(address_params)
        address.end_user_id = current_end_user.id
        if address.save