app/controllers/end_users/cart_items_controller.rb

	def create
		cart_items = CartItem.all
		isExist = false
		id = 0
		cart_items.each do |cart_item|
			if cart_item.item_id == cart_item_params[:item_id].to_i
				isExist = true
				id = cart_item.id
			end
		end

		if isExist
			cart_item = CartItem.find(id)
			sum = cart_item.amount.to_i + cart_item_params[:amount].to_i
			cart_item.update_attributes(amount: sum)
			redirect_to end_users_cart_items_path
		else
			cart_item = CartItem.new(cart_item_params)
			cart_item.end_user_id = current_end_user.id
			cart_item.save
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 6]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2020-04-18 13:28:01.276208"], ["id", 40]]
INSERT INTO "cart_items" ("end_user_id", "item_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["end_user_id", 11], ["item_id", 15], ["amount", 2], ["created_at", "2020-04-18 13:28:36.353210"], ["updated_at", "2020-04-18 13:28:36.353210"]]

	def update
		cart_item = CartItem.find(params[:id])
		cart_item.update(cart_item_params)
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2020-04-18 11:34:16.428942"], ["id", 33]]

	def destroy
		cart_item = CartItem.find(params[:id])
		cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

	def destroy_all
		CartItem.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 37]]