app/controllers/end_users/cart_items_controller.rb

INSERT INTO "cart_items" ("end_user_id", "item_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["end_user_id", 7], ["item_id", 9], ["amount", 1], ["created_at", "2020-04-15 09:54:28.229581"], ["updated_at", "2020-04-15 09:54:28.229581"]]
---
	def create
		cart_item = CartItem.new(cart_item_params)
		cart_item.end_user_id = current_end_user.id
		cart_item.save