app/controllers/end_users/orders_controller.rb

	def vericreate
		session[:order] = Order.new(verification_params)
		session[:order][:end_user_id] = current_end_user.id
		if session[:order]["address_btn"] == 1
		   session[:order]["postal_code"] = current_end_user.postal_code
		   session[:order]["street_address"] = current_end_user.street_address
		   session[:order]["address"] = current_end_user.name

		elsif session[:order]["address_btn"] == 2
			street_address = current_end_user.addresses.find_by(street_address: session[:order]["address_info"])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ? AND "addresses"."street_address" = ? LIMIT ?  [["end_user_id", 2], ["street_address", "ンフォえg"], ["LIMIT", 1]]