app/controllers/end_users/orders_controller.rb

	def new
		@order = Order.new
		@end_user = EndUser.find(current_end_user.id)
		@addresses = current_end_user.addresses.all
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."deleted_at" IS NULL AND "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ?  [["end_user_id", 2]]

	def verification
		if session[:order]["payment_method"] == nil || session[:address_btn] == nil
            redirect_to new_end_users_order_path
		end

		@order = session[:order]
		@end_user = current_end_user
		@postage = 1000
	    @total_price = 0
	    @prices = 0
	    current_end_user.cart_items.each do |cart_item|
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 2]]

	def create
		order = Order.new(end_user_id: current_end_user.id,
						  postage: 1000,
						  payment_method: session[:order]["payment_method"],
						  address: session[:order]["address"],
						  postal_code: session[:order]["postal_code"],
						  total_price: params[:order]["total_price"],
						  street_address: session[:order]["street_address"]
		                  )
		order.save
		session[:order].clear

		current_end_user.cart_items.each do |cart_item|
			order_detail = OrderDetail.new
			order_detail.item_id = cart_item.item.id
			order_detail.order_id = order.id
			order_detail.amount = cart_item.amount
			order_detail.purchase_price = cart_item.item.price
			order_detail.save
		end

		current_end_user.cart_items.destroy_all
---
INSERT INTO "orders" ("end_user_id", "postage", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["end_user_id", 1], ["postage", 1000], ["total_price", 3420], ["created_at", "2020-05-04 11:18:02.878271"], ["updated_at", "2020-05-04 11:18:02.878271"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 2]]
INSERT INTO "orders" ("end_user_id", "address", "postal_code", "street_address", "address_btn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["end_user_id", 2], ["address", ""], ["postal_code", ""], ["street_address", ""], ["address_btn", 1], ["created_at", "2020-05-03 01:20:46.779583"], ["updated_at", "2020-05-03 01:20:46.779583"]]
INSERT INTO "order_details" ("created_at", "updated_at", "item_id", "order_id", "amount", "purchase_price") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2020-05-04 11:33:49.748630"], ["updated_at", "2020-05-04 11:33:49.748630"], ["item_id", 1], ["order_id", 3], ["amount", 1], ["purchase_price", 1200]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

	def vericreate

		session[:order] = Order.new(order_params)
		session[:order][:end_user_id] = current_end_user.id
		if params["address_btn"].to_i == 1
		   session[:order]["postal_code"] = current_end_user.postal_code
		   session[:order]["street_address"] = current_end_user.street_address
		   session[:order]["address"] = current_end_user.name

		elsif params["address_btn"].to_i == 2
			#binding.pry
			address = Address.find(params[:address]["address_id"])
			session[:order]["postal_code"] = address.postal_code
			session[:order]["street_address"] = address.street_address
			session[:order]["address"] = address.address

		else params["address_btn"].to_i == 3
			#binding.pry
			address = Address.new(address_params)
			address.end_user_id = current_end_user.id
			address.save
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("end_user_id", "postage", "payment_method", "address", "postal_code", "street_address", "address_btn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)