app/controllers/end_users_controller.rb

    def update
    	@end_user = EndUser.find(current_end_user.id)
	   	if @end_user.update(end_user_params)
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."deleted_at" IS NULL AND "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "end_users" SET "email" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["email", "kh@khh"], ["updated_at", "2020-03-24 06:45:15.766898"], ["id", 2]]

    def destroy
    	@end_user = EndUser.find(current_end_user.id)
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."deleted_at" IS NULL AND "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]